<a href="https://colab.research.google.com/github/royam0820/Pandas/blob/master/Pandas_20_useful_functions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 20 Pandas function to accelerate your data analysis
[Ref.](https://towardsdatascience.com/20-pandas-functions-that-will-boost-your-data-analysis-process-f5dfdb2f9e05)

In [4]:
import numpy as np
import pandas as pd

## Query
We sometimes need to filter a dataframe based on a condition or apply a mask to get certain values. One easy way to filter a dataframe is query function. Let’s first create a sample dataframe.

In [ ]:
values_1 = np.random.randint(10, size=10)
values_2 = np.random.randint(10, size=10)
years = np.arange(2010,2020)
groups = ['A','A','B','A','B','B','C','A','C','C']
df = pd.DataFrame({'group':groups, 'year':years, 'value_1':values_1, 'value_2':values_2})
df

  group  year  value_1  value_2
0     A  2010        3        3
1     A  2011        3        3
2     B  2012        2        4
3     A  2013        3        8
4     B  2014        6        2
5     B  2015        1        3
6     C  2016        1        9
7     A  2017        2        2
8     C  2018        7        9
9     C  2019        7        4

It is very simple to use query function which only requires to write the condition for filtering.

In [ ]:
df.query('value_1 < value_2')

  group  year  value_1  value_2
1     A  2011        4        5
6     C  2016        0        8
8     C  2018        4        9
9     C  2019        6        7

## Insert
When we want to add a new column to a dataframe, it is added at the end by default. However, pandas offers the option to add the new column in any position using insert function.

We need to specify the position by passing an index as first argument. This value must be an integer. Column indices start from zero just like row indices. The second argument is column name and the third argument is the object that includes values which can be Series or an array-like object.

In [ ]:
#new column
new_col = np.random.randn(10)
#insert the new column at position 2
df.insert(2, 'new_col', new_col)
df

  group  year   new_col  value_1  value_2
0     A  2010 -0.364396        9        5
1     A  2011 -0.984679        4        5
2     B  2012 -0.362939        9        6
3     A  2013 -0.084668        3        2
4     B  2014  0.821039        7        5
5     B  2015 -0.494079        2        0
6     C  2016  1.215772        0        8
7     A  2017  0.449528        7        1
8     C  2018 -1.753770        4        9
9     C  2019 -1.391520        6        7

## Cumulative sum 
`grouby` and `cumsum`

The dataframe contains some yearly values of 3 different groups. We may only be interested in yearly values but there are some cases in which we also need a cumulative sum. Pandas provides an easy-to-use function to calculate cumulative sum which is cumsum.

If we only apply cumsum, groups (A, B, C) will be ignored. This kind of cumulative values may be useless in some cases because we are not able to distinguish between groups. Don’t worry! There is a very simple and convenient solution for this issue. We can apply groupby and then cumsum function.

In [ ]:
df['cumsum_2'] = df[['value_2','group']].groupby('group').cumsum()
df

  group  year   new_col  value_1  value_2  cumsum_2
0     A  2010 -0.364396        9        5         5
1     A  2011 -0.984679        4        5        10
2     B  2012 -0.362939        9        6         6
3     A  2013 -0.084668        3        2        12
4     B  2014  0.821039        7        5        11
5     B  2015 -0.494079        2        0        11
6     C  2016  1.215772        0        8         8
7     A  2017  0.449528        7        1        13
8     C  2018 -1.753770        4        9        17
9     C  2019 -1.391520        6        7        24

## Series
Sample method allows you to select values randomly from a Series or DataFrame. It is useful when we want to select a random sample from a distribution.

In [ ]:
sample1 = df.sample(n=3)
sample1

  group  year   new_col  value_1  value_2  cumsum_2
9     C  2019 -1.391520        6        7        24
2     B  2012 -0.362939        9        6         6
0     A  2010 -0.364396        9        5         5

We specify the number of values with n parameter but we can also pass a ratio to frac parameter. For instance, 0.5 will return half of the rows.

In [ ]:
sample2 = df.sample(frac=0.5)
sample2

  group  year   new_col  value_1  value_2  cumsum_2
6     C  2016  1.215772        0        8         8
2     B  2012 -0.362939        9        6         6
3     A  2013 -0.084668        3        2        12
0     A  2010 -0.364396        9        5         5
7     A  2017  0.449528        7        1        13

To obtain reproducible samples, we can use random_state parameter. If an integer value is passed to random_state, the same sample will be produced every time the code is run.

In [ ]:
# random_state is an int value. If set to a particular integer, it will return same rows as sample in every iteration.
sample2 = df.sample(frac=0.5, random_state=7)
sample2

  group  year   new_col  value_1  value_2  cumsum_2
8     C  2018 -1.753770        4        9        17
5     B  2015 -0.494079        2        0        11
0     A  2010 -0.364396        9        5         5
2     B  2012 -0.362939        9        6         6
1     A  2011 -0.984679        4        5        10

## Where
“Where” is used to replace values in rows or columns based on a condition. The default replacement values is `NaN` but we can also specify the value to be put as a replacement.

In [ ]:
df['new_col'].where(df['new_col'] > 0 , 0)

0    0.000000
1    0.000000
2    0.000000
3    0.000000
4    0.821039
5    0.000000
6    1.215772
7    0.449528
8    0.000000
9    0.000000
Name: new_col, dtype: float64

NOTE:  The way “where” works is that values that fit the condition are selected and the remaining values are replaced with the specified value. where(df[‘new_col’]>0, 0) selects all the values in “new_col” that are greater than 0 and the remaining values are replaced with 0. Thus, where can also be considered as a **mask operation**.

One important point is that `where` for Pandas and NumPy are not exactly the same. We can achieve the same result but with slightly different syntax. 
- With `DataFrame.where`, the values that fit the condition are selected as is and the other values are replaced with the specified value. 
- `Np.where` requires to also specify the value for the ones that fit the condition. The following two lines return the same result:

In [ ]:
# df['new_col'].where(df['new_col'] > 0 , 0)      #dataframe.where example
np.where(df['new_col'] > 0, df['new_col'], 0)   #np.where example

array([0.        , 0.        , 0.        , 0.        , 0.82103871,
       0.        , 1.21577175, 0.44952842, 0.        , 0.        ])

## IsIn
We use filtering or selecting methods a lot when working with dataframes. `Isin` method is kind of an advanced filtering. For example, we can filter values based on a list of selections.

In [ ]:
years = ['2010','2014','2017']
df[df.year.isin(years)]

  group  year   new_col  value_1  value_2  cumsum_2
0     A  2010 -0.364396        9        5         5
4     B  2014  0.821039        7        5        11
7     A  2017  0.449528        7        1        13

## Loc and Iloc
`loc` and `iloc` are used to select rows and columns.
- `loc`: select by labels
- `iloc`: select by positions

`loc` is used to select data by label. The labels of columns are the column names. We need to be careful about row labels. If we do not assign any specific indices, pandas created integer index by default. Thus, the row labels are integers starting from 0 and going up. The row positions that are used with iloc are also integers starting from 0.

###  `iloc`

In [ ]:
# Selecting first 3 rows (axis 0) and first 2 columns (axis 1) with iloc:
df.iloc[:2,:3]

  group  year   new_col
0     A  2010 -0.364396
1     A  2011 -0.984679

In [ ]:
# Selecting first 3 rows (axis 0) and all the columns columns (axis 1) with iloc:
df.iloc[:2,:]

  group  year   new_col  value_1  value_2  cumsum_2
0     A  2010 -0.364396        9        5         5
1     A  2011 -0.984679        4        5        10

### `loc`

In [ ]:
# Selecting first 3 rows and first 2 columns with loc.
df.loc[:2, ['group', 'year']]

  group  year
0     A  2010
1     A  2011
2     B  2012

NOTE:  Upper boundaries of indices are included when `loc` is used whereas they are excluded with `iloc`.

In [ ]:
# Selecting rows [1, 3, 5] and value_1
df.loc[[1,3,5],['value_1']]

   value_1
1        4
3        3
5        2

## Percentage of change
`pct_change` 

This function is used to calculate the percent change through the values in a series. Consider we have a series that contains [2,3,6]. If we apply pct_change to this series, the returned series will be [NaN, 0.5, 1.0]. There is 50% increase from the first element to the second and 100% from the second to the third one. **Pct_change function is useful in comparing the percentage of change in a time series of elements.**

In [ ]:
df.value_1.pct_change()

0         NaN
1    0.000000
2   -0.333333
3    0.500000
4    1.000000
5   -0.833333
6    0.000000
7    1.000000
8    2.500000
9    0.000000
Name: value_1, dtype: float64

### `pct_change - another example

In [ ]:
# Creating the time-series index 
ind = pd.date_range('01/01/2000', periods = 6, freq ='W')

In [ ]:
# Creating the dataframe  
df1 = pd.DataFrame({"A":[14, 4, 5, 4, 1, 55], 
                   "B":[5, 2, 54, 3, 2, 32],  
                   "C":[20, 20, 7, 21, 8, 5], 
                   "D":[14, 3, 6, 2, 6, 4]}, index = ind)

In [ ]:
df1

             A   B   C   D
2000-01-02  14   5  20  14
2000-01-09   4   2  20   3
2000-01-16   5  54   7   6
2000-01-23   4   3  21   2
2000-01-30   1   2   8   6
2000-02-06  55  32   5   4

In [ ]:
# find the percentage change with the previous row 
df.pct_change()

                    A          B         C         D
2000-01-02        NaN        NaN       NaN       NaN
2000-01-09  -0.714286  -0.600000  0.000000 -0.785714
2000-01-16   0.250000  26.000000 -0.650000  1.000000
2000-01-23  -0.200000  -0.944444  2.000000 -0.666667
2000-01-30  -0.750000  -0.333333 -0.619048  2.000000
2000-02-06  54.000000  15.000000 -0.375000 -0.333333

In [ ]:
# apply the pct_change() method 
# we use the forward fill method to 
# fill the missing values in the dataframe 
df.pct_change(fill_method ='ffill')

                    A          B         C         D
2000-01-02        NaN        NaN       NaN       NaN
2000-01-09  -0.714286  -0.600000  0.000000 -0.785714
2000-01-16   0.250000  26.000000 -0.650000  1.000000
2000-01-23  -0.200000  -0.944444  2.000000 -0.666667
2000-01-30  -0.750000  -0.333333 -0.619048  2.000000
2000-02-06  54.000000  15.000000 -0.375000 -0.333333

NOTE:  
- `fill_method`:  How to handle NAs before computing percent changes.

The first row contains `NaN` values, as there is no previous row from which we can calculate the change. All the `NaN` values in the dataframe has been filled using `ffill` method.

## Rank
`rank` The Rank function assigns rank to the values. Assume we have a series s that contains `[1,7,5,3]`. The ranks assigned to these values will be `[1,4,3,2]`.

In [ ]:
df['rank_1'] = df['value_1'].rank()
df

  group  year  value_1  value_2  rank_1
0     A  2010        3        3     6.0
1     A  2011        3        3     6.0
2     B  2012        2        4     3.5
3     A  2013        3        8     6.0
4     B  2014        6        2     8.0
5     B  2015        1        3     1.5
6     C  2016        1        9     1.5
7     A  2017        2        2     3.5
8     C  2018        7        9     9.5
9     C  2019        7        4     9.5

## Melt
`Pandas.melt()` function **unpivots a DataFrame from wide format to long format**.  In effect, it converts a wide dataframe to a narrow one.

One or more columns are **identifier variables**, while all other columns, considered **measured variables**, they are unpivoted to the row axis, leaving just two non-identifier columns, variable and value.

In [5]:
df_wide = pd.DataFrame(
  {"student": ["Andy", "Bernie", "Cindy", "Deb"],
   "school":  ["Z", "Y", "Z", "Y"],
   "english": [10, 100, 1000, 10000],  # eng grades
   "math":    [20, 200, 2000, 20000],  # math grades
   "physics": [30, 300, 3000, 30000]   # physics grades
  }
)
df_wide

  student school  english   math  physics
0    Andy      Z       10     20       30
1  Bernie      Y      100    200      300
2   Cindy      Z     1000   2000     3000
3     Deb      Y    10000  20000    30000

NOTE: the subjects `english`, `math`, `physics` will be unpivoted with the `melt` function thus narrowing the table above from 5 columns to 4 columns.

We will create two variables `var_name` and `value_name`
- `var_name` will create a column `class` in the melted dataframe storing the subjects mentioned above.
- `value_name` will create a column `grade` to store the grade for each student. see below. 

See example below.

### Example 1

In [6]:
df_wide.melt(id_vars=["student", "school"],
             var_name="class",
             value_name="grade")

   student school    class  grade
0     Andy      Z  english     10
1   Bernie      Y  english    100
2    Cindy      Z  english   1000
3      Deb      Y  english  10000
4     Andy      Z     math     20
5   Bernie      Y     math    200
6    Cindy      Z     math   2000
7      Deb      Y     math  20000
8     Andy      Z  physics     30
9   Bernie      Y  physics    300
10   Cindy      Z  physics   3000
11     Deb      Y  physics  30000

### Example 2

In [16]:
df1_wide = pd.DataFrame(
  {"city": ["A", "B", "C", "D", "E"],
   "day1": [22, 10, 25, 18, 52],
   "day2": [25, 14, 22, 15, 14],  
   "day2": [28, 13, 26, 17, 15], 
   "day3": [26, 12, 24, 18, 17]
  }
)
df1_wide

  city  day1  day2  day3
0    A    22    28    26
1    B    10    13    12
2    C    25    26    24
3    D    18    17    18
4    E    52    15    17

In [17]:
df1_wide.melt(id_vars=['city'])

   city variable  value
0     A     day1     22
1     B     day1     10
2     C     day1     25
3     D     day1     18
4     E     day1     52
5     A     day2     28
6     B     day2     13
7     C     day2     26
8     D     day2     17
9     E     day2     15
10    A     day3     26
11    B     day3     12
12    C     day3     24
13    D     day3     18
14    E     day3     17

In [18]:
df1_wide.melt(id_vars=["city", ],
             var_name="'temperature",
             value_name="day1, day2, day3,")

   city 'temperature  day1, day2, day3,
0     A         day1                 22
1     B         day1                 10
2     C         day1                 25
3     D         day1                 18
4     E         day1                 52
5     A         day2                 28
6     B         day2                 13
7     C         day2                 26
8     D         day2                 17
9     E         day2                 15
10    A         day3                 26
11    B         day3                 12
12    C         day3                 24
13    D         day3                 18
14    E         day3                 17

## Explode
Assume your data set includes multiple entries of a feature on a single observation (row) but you want to analyze them on separate rows.

In [21]:
df = pd.DataFrame(
  {"ID": ["A", "B", "C"],
   "Measurement": [4, 6, [2, 3, 8]],
   "day": [1, 1, 1]
  }
)
df

  ID Measurement  day
0  A           4    1
1  B           6    1
2  C   [2, 3, 8]    1

We want to see the measurements of `C` on day `1` on separate rows which easily be done using explode.

In [22]:
df.explode('Measurement').reset_index(drop=True)

  ID Measurement  day
0  A           4    1
1  B           6    1
2  C           2    1
3  C           3    1
4  C           8    1

NOTE: the ID value `C` has its measurement exploded from the array `[2,3,8]`

## Number of unique values
`Nunique` **counts the number of unique entries over columns or rows**. It is very useful in categorical features especially in cases where we do not know the number of categories beforehand. Let’s take a look at our initial dataframe:

In [24]:
df1 = pd.DataFrame(
  {"group":     ["A", "A", "B", "A", "B", "B","C", "A", "C", "C"],
   "year":      ["2010", "2011", "2012", "2013", "2014", "2015", "2016", "2017", "2018", "2019"],
   "new_col":   [0.33281, 0.122312, 0.551692, -1.515015, 0.078729, -0.375737, -1.159010, -0.161005, 0.275412, 0.113718],
   "value_1":   [2, 3, 5, 9, 6, 7, 4, 8, 4, 0],
   "value_2":   [3, 3, 1, 4, 1, 9, 2, 5, 6, 9],
   "cumsum_2":  [3, 6, 1, 10, 2, 11, 2, 15, 8, 17],
   "rank_1":    [2.0, 3.0, 6.0, 10.0, 7.0, 8.0, 4.5, 9.0, 4.5, 1.0]
  }
)
df1

  group  year   new_col  value_1  value_2  cumsum_2  rank_1
0     A  2010  0.332810        2        3         3     2.0
1     A  2011  0.122312        3        3         6     3.0
2     B  2012  0.551692        5        1         1     6.0
3     A  2013 -1.515015        9        4        10    10.0
4     B  2014  0.078729        6        1         2     7.0
5     B  2015 -0.375737        7        9        11     8.0
6     C  2016 -1.159010        4        2         2     4.5
7     A  2017 -0.161005        8        5        15     9.0
8     C  2018  0.275412        4        6         8     4.5
9     C  2019  0.113718        0        9        17     1.0

In [31]:
df1.year.nunique()

10

In [30]:
df1.group.nunique()

3

We can directly the `nunique` function to the dataframe and see the number of unique values in each column:

In [32]:
df1.nunique()

group        3
year        10
new_col     10
value_1      9
value_2      7
cumsum_2     9
rank_1       9
dtype: int64

If axis parameter is set to 1, the `nunique` function returns the number of unique values in each row.

In [35]:
df1.nunique(axis=1)

0    5
1    5
2    6
3    6
4    7
5    7
6    6
7    7
8    7
9    7
dtype: int64

NOTE:  `nunique` counts distinct observations over requested axis. It returns Series with number of distinct observations. Can ignore NaN values.

## Lookup
It can be used to look up values in the DataFrame based on the values on other row, column pairs. This function is best explained via an example. Assume we have the following DataFrame:

In [37]:
df2 = pd.DataFrame(
  {"Day":     [1, 2, 3, 4, 5, 6, 7, 8],
   "Person":  ["Alex", "John", "Alex", "Dereck", "Oscar", "John", "Dereck", "Dereck"],
   "John":    [4, 7, 8, 9, 2, 6, 6, 5],
   "Alex":    [4, 6, 9, 2, 6, 6, 5, 5],
   "Oscar":   [4, 2, 3, 5, 1, 4, 5, 9],
   "Dereck":  [6, 2, 1, 8, 7, 8, 4, 5]
  }
)
df2

   Day  Person  John  Alex  Oscar  Dereck
0    1    Alex     4     4      4       6
1    2    John     7     6      2       2
2    3    Alex     8     9      3       1
3    4  Dereck     9     2      5       8
4    5   Oscar     2     6      1       7
5    6    John     6     6      4       8
6    7  Dereck     6     5      5       4
7    8  Dereck     5     5      9       5

For each day, we have measurements of 4 people and a column that includes the names of these 4 people. We want to create a new column that shows the measurement of the person in `Person` column. Thus, for the first row, the value in the new column will be 4 (the value in column “Alex”).

In [39]:
df2['Person_point'] = df2.lookup(df2.index, df2['Person'])
df2

   Day  Person  John  Alex  Oscar  Dereck  Person_point
0    1    Alex     4     4      4       6             4
1    2    John     7     6      2       2             7
2    3    Alex     8     9      3       1             9
3    4  Dereck     9     2      5       8             8
4    5   Oscar     2     6      1       7             1
5    6    John     6     6      4       8             6
6    7  Dereck     6     5      5       4             4
7    8  Dereck     5     5      9       5             5

## Infer objects
Pandas supports a wide range of data types, one of which is `object`. `object` covers text or mixed (numeric and non-numeric) values. However, it is not preferred to use object data type if a different option is available. Certain operations is executed faster with more specific data types. For example, we prefer to have integer or float data type for numerical values.
`infer_objects` attempts to infer better data types for object columns. Consider the following dataframe:

In [42]:
df3 = pd.DataFrame(
  {"A":     [1, 2, 3, 4],
   "B":     [2.1, 1.5, 2, 2.1],
   "C":    ["True", "False", "False", "True"],
   "D":    ["b", "c", "d", "f"]
  }
)
df3

   A    B      C  D
0  1  2.1   True  b
1  2  1.5  False  c
2  3  2.0  False  d
3  4  2.1   True  f

In [45]:
df3.dtypes

A      int64
B    float64
C     object
D     object
dtype: object

In [46]:
df3.infer_objects().dtypes

A      int64
B    float64
C     object
D     object
dtype: object

NOTE: `infer_objects` seems to be the same as `dtypes`!

## Memory Usage
Memory_usage() returns **how much memory each row uses in bytes**. It is useful especially when we work with large dataframes. Consider the following dataframe with 1 million rows.

In [47]:
df_large = pd.DataFrame({'A': np.random.randn(1000000),
                    'B': np.random.randint(100, size=1000000)})
df_large.shape

(1000000, 2)

And the memory usage for each column in bytes:

In [48]:
df_large.memory_usage().sum() / (1024**2) #conversion to megabytes

15.2589111328125

## Describe
Describe function calculates basic statistics for numeric columns which are count, mean, standard deviation, min and max values, median, first and third quartile. Thus, **it provides a statistical summary of the dataframe**.

In [53]:
df1

  group  year   new_col  value_1  value_2  cumsum_2  rank_1
0     A  2010  0.332810        2        3         3     2.0
1     A  2011  0.122312        3        3         6     3.0
2     B  2012  0.551692        5        1         1     6.0
3     A  2013 -1.515015        9        4        10    10.0
4     B  2014  0.078729        6        1         2     7.0
5     B  2015 -0.375737        7        9        11     8.0
6     C  2016 -1.159010        4        2         2     4.5
7     A  2017 -0.161005        8        5        15     9.0
8     C  2018  0.275412        4        6         8     4.5
9     C  2019  0.113718        0        9        17     1.0

Let's calculate basic statistics for numeric columns.

In [52]:
df1.describe()

         new_col    value_1    value_2   cumsum_2     rank_1
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean   -0.173609   4.800000   4.300000   7.500000   5.500000
std     0.669107   2.780887   2.945807   5.681354   3.018462
min    -1.515015   0.000000   1.000000   1.000000   1.000000
25%    -0.322054   3.250000   2.250000   2.250000   3.375000
50%     0.096223   4.500000   3.500000   7.000000   5.250000
75%     0.237137   6.750000   5.750000  10.750000   7.750000
max     0.551692   9.000000   9.000000  17.000000  10.000000

## Merge
`merge()` combines DataFrames based on values in shared columns. Consider the following two dataframes.

In [55]:
df4 = pd.DataFrame(
  {"col_a":     [1, 2, 3, 4],
   "col_b":     ["a", "b", "c", "d"],
   "col_c":    ["True", "True", "False", "True"]
  }
)
df4

   col_a col_b  col_c
0      1     a   True
1      2     b   True
2      3     c  False
3      4     d   True

In [56]:
df5 = pd.DataFrame(
  {"col_a":     [1, 2, 9, 10],
   "col_b":     ["a", "k", "l", "m"],
   "col_c":    ["False", "False", "False", "True"]
  }
)
df5

   col_a col_b  col_c
0      1     a  False
1      2     k  False
2      9     l  False
3     10     m   True

We can merge them based on shared values in a column. The parameter that sets the condition for merging is the `on` parameter.

In [58]:
df_merge = pd.merge(df4, df5, on="col_a")

In [59]:
df_merge

   col_a col_b_x col_c_x col_b_y col_c_y
0      1       a    True       a   False
1      2       b    True       k   False

NOTE:  `df4` and `df5` are merged based on the common values in `col_a`. The how parameter of merge function allows to combine dataframes in different ways. The possible values for how are `inner`, `outer`, `left`, `right`.
- `inner`: only rows with same values in the column specified by on parameter (**default value** of how parameter)
- `outer`: all the rows
- `left`: all rows from left DataFrame
- `right`: all rows from right DataFrame

## Select datatypes
`select_dtypes` function returns a subset of the DataFrame’s columns based on the condition set on data types. It allows to include or exclude certain data types using include and exlude parameters.

In [66]:
df1

  group  year   new_col  value_1  value_2  cumsum_2  rank_1
0     A  2010  0.332810        2        3         3     2.0
1     A  2011  0.122312        3        3         6     3.0
2     B  2012  0.551692        5        1         1     6.0
3     A  2013 -1.515015        9        4        10    10.0
4     B  2014  0.078729        6        1         2     7.0
5     B  2015 -0.375737        7        9        11     8.0
6     C  2016 -1.159010        4        2         2     4.5
7     A  2017 -0.161005        8        5        15     9.0
8     C  2018  0.275412        4        6         8     4.5
9     C  2019  0.113718        0        9        17     1.0

In [65]:
df1.dtypes

group        object
year         object
new_col     float64
value_1       int64
value_2       int64
cumsum_2      int64
rank_1      float64
dtype: object

In [68]:
# include dtypes of int64
df1.select_dtypes(include='int64')

   value_1  value_2  cumsum_2
0        2        3         3
1        3        3         6
2        5        1         1
3        9        4        10
4        6        1         2
5        7        9        11
6        4        2         2
7        8        5        15
8        4        6         8
9        0        9        17

In [70]:
# exclude dtypes of int64
df1.select_dtypes(exclude='int64')

  group  year   new_col  rank_1
0     A  2010  0.332810     2.0
1     A  2011  0.122312     3.0
2     B  2012  0.551692     6.0
3     A  2013 -1.515015    10.0
4     B  2014  0.078729     7.0
5     B  2015 -0.375737     8.0
6     C  2016 -1.159010     4.5
7     A  2017 -0.161005     9.0
8     C  2018  0.275412     4.5
9     C  2019  0.113718     1.0

## Replace
As the name suggests, it allows to replace values in a dataframe.

In [71]:
df1.replace('A', 'A_1')

  group  year   new_col  value_1  value_2  cumsum_2  rank_1
0   A_1  2010  0.332810        2        3         3     2.0
1   A_1  2011  0.122312        3        3         6     3.0
2     B  2012  0.551692        5        1         1     6.0
3   A_1  2013 -1.515015        9        4        10    10.0
4     B  2014  0.078729        6        1         2     7.0
5     B  2015 -0.375737        7        9        11     8.0
6     C  2016 -1.159010        4        2         2     4.5
7   A_1  2017 -0.161005        8        5        15     9.0
8     C  2018  0.275412        4        6         8     4.5
9     C  2019  0.113718        0        9        17     1.0

NOTE: The first parameter is the value to replaced and the second one is the new value.

We can also pass in a dictionary for multiple replacements at the same time.

In [72]:
df1.replace({'A':'A_1', 'B':'B_1'})

  group  year   new_col  value_1  value_2  cumsum_2  rank_1
0   A_1  2010  0.332810        2        3         3     2.0
1   A_1  2011  0.122312        3        3         6     3.0
2   B_1  2012  0.551692        5        1         1     6.0
3   A_1  2013 -1.515015        9        4        10    10.0
4   B_1  2014  0.078729        6        1         2     7.0
5   B_1  2015 -0.375737        7        9        11     8.0
6     C  2016 -1.159010        4        2         2     4.5
7   A_1  2017 -0.161005        8        5        15     9.0
8     C  2018  0.275412        4        6         8     4.5
9     C  2019  0.113718        0        9        17     1.0

## Applying a function to a dataframe
`applymap` function is used to apply a function to a dataframe elementwise. 

Please note that if a vectorized version of an operation is available, it should be preferred over applymap. For instance, if we want to multiply each element by a number, we don’t need and should not use applymap function. A simple vectorized operation (e.g. df * 4 ) is much faster in that case.

However, there might be some cases where we do not have the option of vectorized operation. For instance, we can change the style of a dataframe using Style property of pandas dataframes. The following function changes the color of negative values as red.

In [82]:
np.random.seed(24)
df = pd.DataFrame({'A': np.linspace(1, 10, 10)})
df = pd.concat([df, pd.DataFrame(np.random.randn(10, 4), columns=list('BCDE'))],
               axis=1)
print("Original array:")
print(df)

# function to apply on dataframe
def color_negative_red(val):
    color = 'red' if val < 0 else 'black'
    return 'color: %s' % color

print("\nNegative numbers red and positive numbers black:")
df.style.applymap(color_negative_red) # applying red color on negative values

Original array:
      A         B         C         D         E
0   1.0  1.329212 -0.770033 -0.316280 -0.990810
1   2.0 -1.070816 -1.438713  0.564417  0.295722
2   3.0 -1.626404  0.219565  0.678805  1.889273
3   4.0  0.961538  0.104011 -0.481165  0.850229
4   5.0  1.453425  1.057737  0.165562  0.515018
5   6.0 -1.336936  0.562861  1.392855 -0.063328
6   7.0  0.121668  1.207603 -0.002040  1.627796
7   8.0  0.354493  1.037528 -0.385684  0.519818
8   9.0  1.686583 -1.325963  1.428984 -2.089354
9  10.0 -0.129820  0.631523 -0.586538  0.290720

Negative numbers red and positive numbers black: